<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="3" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_153669" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="ShapeOf_153655" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_153657" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_153659" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Gather_153660" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_153662" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_153664" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_153666" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_153667" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Broadcast_153670" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ReadValue_152610" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.9.valuepresent.9.value" variable_type="f32" variable_shape="?,32,?,96" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.9.value">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_151307" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_151308" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_138701" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3072" offset="28" size="12288" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="u8" shape="32064, 3072" offset="12316" size="98500608" />
			<output>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_176549" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.model.embed_tokens.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="32064, 1" offset="98512924" size="32064" />
			<output>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_176552" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.model.embed_tokens.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="self.model.embed_tokens.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="32064, 1" offset="98544988" size="64128" />
			<output>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.embed_tokens.weight/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.embed_tokens/ov_ext::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.embed_tokens/ov_ext::embedding/Convert_1" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.embed_tokens/ov_ext::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="28" name="__module.model.embed_tokens/ov_ext::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="319,375,386,hidden_states.1,hidden_states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_138625" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3072" offset="98609116" size="12288" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_138624" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="98621404" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_138622" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="98621408" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.layers.0.input_layernorm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="376">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_407" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="98621412" size="8" />
			<output>
				<port id="0" precision="I64" names="377">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.layers.0.input_layernorm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="378,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_138623" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="98621420" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.model.layers.0.input_layernorm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="379">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="380">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="381,382,hidden_states.5,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="383,385,hidden_states.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.model.layers.0.self_attn.qkv_proj.weight" type="Const" version="opset1">
			<data element_type="i4" shape="9216, 3072" offset="98621424" size="14155776" />
			<output>
				<port id="0" precision="I4">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_321363" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I4">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="self.model.layers.0.self_attn.qkv_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="9216, 1" offset="112777200" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="self.model.layers.0.self_attn.qkv_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>9216</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.layers.0.self_attn.qkv_proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.layers.0.self_attn.qkv_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="392,qkv.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_452" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_454" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795632" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_456" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_450" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795648" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.layers.0.self_attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="393,query_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_147870" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="112795656" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="397">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.layers.0.self_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="112795688" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.model.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="398,q.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_769" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.model.layers.0.self_attn.rotary_emb/aten::to/Convert_2" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1" offset="112795704" size="192" />
			<output>
				<port id="0" precision="FP32" names="417">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="ShapeOf_145031" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_145032" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_145033" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="61" name="Gather_145034" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1081,1246,1411,1576,1741,1906,2071,2236,2401,2566,2731,2896,3061,321,3226,3391,353,3556,3721,3886,4051,418,4216,4381,4546,4711,4876,5041,5206,5371,5536,586,751,916">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_113231" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_113233" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.layers.0.self_attn.rotary_emb/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.layers.0.self_attn.rotary_emb/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1083,1088,1248,1253,1413,1418,1578,1583,1743,1748,1908,1913,2073,2078,2238,2243,2403,2408,2568,2573,2733,2738,2898,2903,3063,3068,3228,3233,3393,3398,3558,3563,3723,3728,3888,3893,4053,4058,420,4218,4223,425,4383,4388,4548,4553,4713,4718,4878,4883,5043,5048,5208,5213,5373,5378,5538,5543,588,593,753,758,918,923,inv_freq_expanded,inv_freq_expanded.1,inv_freq_expanded.101,inv_freq_expanded.103,inv_freq_expanded.105,inv_freq_expanded.107,inv_freq_expanded.109,inv_freq_expanded.11,inv_freq_expanded.111,inv_freq_expanded.113,inv_freq_expanded.115,inv_freq_expanded.117,inv_freq_expanded.119,inv_freq_expanded.121,inv_freq_expanded.123,inv_freq_expanded.125,inv_freq_expanded.13,inv_freq_expanded.15,inv_freq_expanded.17,inv_freq_expanded.19,inv_freq_expanded.21,inv_freq_expanded.23,inv_freq_expanded.25,inv_freq_expanded.27,inv_freq_expanded.29,inv_freq_expanded.3,inv_freq_expanded.31,inv_freq_expanded.33,inv_freq_expanded.35,inv_freq_expanded.37,inv_freq_expanded.39,inv_freq_expanded.41,inv_freq_expanded.43,inv_freq_expanded.45,inv_freq_expanded.47,inv_freq_expanded.49,inv_freq_expanded.5,inv_freq_expanded.51,inv_freq_expanded.53,inv_freq_expanded.55,inv_freq_expanded.57,inv_freq_expanded.59,inv_freq_expanded.61,inv_freq_expanded.63,inv_freq_expanded.65,inv_freq_expanded.67,inv_freq_expanded.69,inv_freq_expanded.7,inv_freq_expanded.71,inv_freq_expanded.73,inv_freq_expanded.75,inv_freq_expanded.77,inv_freq_expanded.79,inv_freq_expanded.81,inv_freq_expanded.83,inv_freq_expanded.85,inv_freq_expanded.87,inv_freq_expanded.89,inv_freq_expanded.9,inv_freq_expanded.91,inv_freq_expanded.93,inv_freq_expanded.95,inv_freq_expanded.97,inv_freq_expanded.99">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_147871" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="112795896" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1084,1249,1414,1579,1744,1909,2074,2239,2404,2569,2734,2899,3064,316,317,3229,3394,3559,3724,3889,4054,421,4219,4384,4549,4714,4879,5044,5209,5374,5539,589,754,919,position_ids_1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="244" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64" names="244" />
			</output>
		</layer>
		<layer id="69" name="__module.model.layers.0.self_attn.rotary_emb/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="1085,1086,1250,1251,1415,1416,1580,1581,1745,1746,1910,1911,2075,2076,2240,2241,2405,2406,2570,2571,2735,2736,2900,2901,3065,3066,3230,3231,3395,3396,3560,3561,3725,3726,3890,3891,4055,4056,422,4220,4221,423,4385,4386,4550,4551,4715,4716,4880,4881,5045,5046,5210,5211,5375,5376,5540,5541,590,591,755,756,920,921">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.layers.0.self_attn.rotary_emb/aten::to/Convert_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1087,1089,1252,1254,1417,1419,1582,1584,1747,1749,1912,1914,2077,2079,2242,2244,2407,2409,2572,2574,2737,2739,2902,2904,3067,3069,3232,3234,3397,3399,3562,3564,3727,3729,3892,3894,4057,4059,4222,4224,424,426,4387,4389,4552,4554,4717,4719,4882,4884,5047,5049,5212,5214,5377,5379,5542,5544,592,594,757,759,922,924,position_ids_expanded,position_ids_expanded.1,position_ids_expanded.101,position_ids_expanded.103,position_ids_expanded.105,position_ids_expanded.107,position_ids_expanded.109,position_ids_expanded.11,position_ids_expanded.111,position_ids_expanded.113,position_ids_expanded.115,position_ids_expanded.117,position_ids_expanded.119,position_ids_expanded.121,position_ids_expanded.123,position_ids_expanded.125,position_ids_expanded.13,position_ids_expanded.15,position_ids_expanded.17,position_ids_expanded.19,position_ids_expanded.21,position_ids_expanded.23,position_ids_expanded.25,position_ids_expanded.27,position_ids_expanded.29,position_ids_expanded.3,position_ids_expanded.31,position_ids_expanded.33,position_ids_expanded.35,position_ids_expanded.37,position_ids_expanded.39,position_ids_expanded.41,position_ids_expanded.43,position_ids_expanded.45,position_ids_expanded.47,position_ids_expanded.49,position_ids_expanded.5,position_ids_expanded.51,position_ids_expanded.53,position_ids_expanded.55,position_ids_expanded.57,position_ids_expanded.59,position_ids_expanded.61,position_ids_expanded.63,position_ids_expanded.65,position_ids_expanded.67,position_ids_expanded.69,position_ids_expanded.7,position_ids_expanded.71,position_ids_expanded.73,position_ids_expanded.75,position_ids_expanded.77,position_ids_expanded.79,position_ids_expanded.81,position_ids_expanded.83,position_ids_expanded.85,position_ids_expanded.87,position_ids_expanded.89,position_ids_expanded.9,position_ids_expanded.91,position_ids_expanded.93,position_ids_expanded.95,position_ids_expanded.97,position_ids_expanded.99">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.layers.0.self_attn.rotary_emb/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1090,1255,1420,1585,1750,1915,2080,2245,2410,2575,2740,2905,3070,3235,3400,3565,3730,3895,4060,4225,427,4390,4555,4720,4885,5050,5215,5380,5545,595,760,925">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.layers.0.self_attn.rotary_emb/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="112795912" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.layers.0.self_attn.rotary_emb/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1091,1256,1421,1586,1751,1916,2081,2246,2411,2576,2741,2906,3071,3236,3401,3566,3731,3896,4061,4226,428,4391,4556,4721,4886,5051,5216,5381,5546,596,761,926,freqs,freqs.1,freqs.11,freqs.13,freqs.15,freqs.17,freqs.19,freqs.21,freqs.23,freqs.25,freqs.27,freqs.29,freqs.3,freqs.31,freqs.33,freqs.35,freqs.37,freqs.39,freqs.41,freqs.43,freqs.45,freqs.47,freqs.49,freqs.5,freqs.51,freqs.53,freqs.55,freqs.57,freqs.59,freqs.61,freqs.7,freqs.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.layers.0.self_attn.rotary_emb/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1093,1258,1423,1588,1753,1918,2083,2248,2413,2578,2743,2908,3073,3238,3403,3568,3733,3898,4063,4228,430,4393,4558,4723,4888,5053,5218,5383,5548,598,763,928,emb,emb.1,emb.11,emb.13,emb.15,emb.17,emb.19,emb.21,emb.23,emb.25,emb.27,emb.29,emb.3,emb.31,emb.33,emb.35,emb.37,emb.39,emb.41,emb.43,emb.45,emb.47,emb.49,emb.5,emb.51,emb.53,emb.55,emb.57,emb.59,emb.61,emb.7,emb.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.layers.0.self_attn.rotary_emb/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1094,1259,1424,1589,1754,1919,2084,2249,2414,2579,2744,2909,3074,3239,3404,3569,3734,3899,4064,4229,431,4394,4559,4724,4889,5054,5219,5384,5549,599,764,929">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_138626" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="112795924" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.layers.0.self_attn.rotary_emb/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1095,1098,1101,1260,1263,1266,1425,1428,1431,1590,1593,1596,1755,1758,1761,1920,1923,1926,2085,2088,2091,2250,2253,2256,2415,2418,2421,2580,2583,2586,2745,2748,2751,2910,2913,2916,3075,3078,3081,3240,3243,3246,3405,3408,3411,3570,3573,3576,3735,3738,3741,3900,3903,3906,4065,4068,4071,4230,4233,4236,432,435,438,4395,4398,4401,4560,4563,4566,4725,4728,4731,4890,4893,4896,5055,5058,5061,5220,5223,5226,5385,5388,5391,5550,5553,5556,600,603,606,765,768,771,930,933,936,cos.1,cos.103,cos.105,cos.109,cos.111,cos.115,cos.117,cos.121,cos.123,cos.127,cos.129,cos.13,cos.133,cos.135,cos.139,cos.141,cos.145,cos.147,cos.15,cos.151,cos.153,cos.157,cos.159,cos.163,cos.165,cos.169,cos.171,cos.175,cos.177,cos.181,cos.183,cos.187,cos.189,cos.19,cos.21,cos.25,cos.27,cos.3,cos.31,cos.33,cos.37,cos.39,cos.43,cos.45,cos.49,cos.51,cos.55,cos.57,cos.61,cos.63,cos.67,cos.69,cos.7,cos.73,cos.75,cos.79,cos.81,cos.85,cos.87,cos.9,cos.91,cos.93,cos.97,cos.99">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1103,1268,1433,1598,1763,1928,2093,2258,2423,2588,2753,2918,3083,3248,3413,3578,3743,3908,4073,4238,440,4403,4568,4733,4898,5063,5228,5393,5558,608,773,938,cos,cos.101,cos.107,cos.11,cos.113,cos.119,cos.125,cos.131,cos.137,cos.143,cos.149,cos.155,cos.161,cos.167,cos.17,cos.173,cos.179,cos.185,cos.23,cos.29,cos.35,cos.41,cos.47,cos.5,cos.53,cos.59,cos.65,cos.71,cos.77,cos.83,cos.89,cos.95">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_118882" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795928" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.layers.0.self_attn/aten::size/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="82" name="__module.model.layers.0.self_attn/aten::size/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="1105,1270,1435,1600,1765,1930,2095,2260,2425,2590,2755,2920,3085,3250,3415,3580,3745,3910,4075,4240,4405,442,4570,4735,4900,5065,5230,5395,5560,610,775,940">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_772" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_767" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795928" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model.layers.0.self_attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="443,q_rot.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.model.layers.0.self_attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="447">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_462" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795632" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_464" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795936" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_466" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_460" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795648" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.layers.0.self_attn/aten::slice/Slice_5" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="394,key_states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_147872" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="112795656" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="400">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.layers.0.self_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="112795688" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="401,key_states.5">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_787" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_790" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_785" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795928" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.layers.0.self_attn/aten::slice/Slice_6" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="445,k_rot.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_5" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="230" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="112795928" size="8" />
			<output>
				<port id="0" precision="I64" names="230" />
			</output>
		</layer>
		<layer id="102" name="__module.model.layers.0.self_attn/aten::size/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="103" name="__module.model.layers.0.self_attn/aten::size/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="1111,1116,1129,1134,1276,1281,1294,1299,1441,1446,1459,1464,1606,1611,1624,1629,1771,1776,1789,1794,1936,1941,1954,1959,2101,2106,2119,2124,2266,2271,2284,2289,2431,2436,2449,2454,2596,2601,2614,2619,2761,2766,2779,2784,2926,2931,2944,2949,3091,3096,3109,3114,3256,3261,3274,3279,3421,3426,3439,3444,3586,3591,3604,3609,3751,3756,3769,3774,3916,3921,3934,3939,4081,4086,4099,4104,4246,4251,4264,4269,4411,4416,4429,4434,448,453,4576,4581,4594,4599,466,471,4741,4746,4759,4764,4906,4911,4924,4929,5071,5076,5089,5094,5236,5241,5254,5259,5401,5406,5419,5424,5566,5571,5584,5589,616,621,634,639,781,786,799,804,946,951,964,969" />
			</output>
		</layer>
		<layer id="104" name="Constant_58" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="112795648" size="8" />
			<output>
				<port id="0" precision="I64" names="219" />
			</output>
		</layer>
		<layer id="105" name="__module.model.layers.0.self_attn/aten::floor_divide/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="106" name="__module.model.layers.0.self_attn/aten::floor_divide/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="1113,1114,1118,1119,1131,1132,1136,1137,1278,1279,1283,1284,1296,1297,1301,1302,1443,1444,1448,1449,1461,1462,1466,1467,1608,1609,1613,1614,1626,1627,1631,1632,1773,1774,1778,1779,1791,1792,1796,1797,1938,1939,1943,1944,1956,1957,1961,1962,2103,2104,2108,2109,2121,2122,2126,2127,2268,2269,2273,2274,2286,2287,2291,2292,2433,2434,2438,2439,2451,2452,2456,2457,2598,2599,2603,2604,2616,2617,2621,2622,2763,2764,2768,2769,2781,2782,2786,2787,2928,2929,2933,2934,2946,2947,2951,2952,3093,3094,3098,3099,3111,3112,3116,3117,3258,3259,3263,3264,3276,3277,3281,3282,3423,3424,3428,3429,3441,3442,3446,3447,3588,3589,3593,3594,3606,3607,3611,3612,3753,3754,3758,3759,3771,3772,3776,3777,3918,3919,3923,3924,3936,3937,3941,3942,4083,4084,4088,4089,4101,4102,4106,4107,4248,4249,4253,4254,4266,4267,4271,4272,4413,4414,4418,4419,4431,4432,4436,4437,450,451,455,456,4578,4579,4583,4584,4596,4597,4601,4602,468,469,473,474,4743,4744,4748,4749,4761,4762,4766,4767,4908,4909,4913,4914,4926,4927,4931,4932,5073,5074,5078,5079,5091,5092,5096,5097,5238,5239,5243,5244,5256,5257,5261,5262,5403,5404,5408,5409,5421,5422,5426,5427,5568,5569,5573,5574,5586,5587,5591,5592,618,619,623,624,636,637,641,642,783,784,788,789,801,802,806,807,948,949,953,954,966,967,971,972" />
			</output>
		</layer>
		<layer id="107" name="Constant_88641" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="98621412" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.model.layers.0.self_attn/aten::slice/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_951" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795944" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_953" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795640" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_910" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112795928" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.layers.0.self_attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="457,x2.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.model.layers.0.self_attn/aten::neg/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="112795952" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="114" name="__module.model.layers.0.self_attn/aten::neg/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="__module.model.layers.0.self_attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="458">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_818" type="Const" version="opset1">
