<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_161366" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_161366">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_161372" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="2" name="StringTensorUnpack_161367" type="StringTensorUnpack" version="opset15">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="ShapeOf_161368" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_161369" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="Constant_161370" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="6" name="Gather_161371" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="7" name="Constant_161373" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Range_161374" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_161375" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Constant_161376" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Add_161377" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="Constant_161378" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Range_161379" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_161441" type="Const" version="opset1">
			<data element_type="u8" shape="328" offset="16" size="328" />
			<output>
				<port id="0" precision="U8">
					<dim>328</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="SpecialTokensSplit_161442" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>328</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_161444" type="Const" version="opset1">
			<data element_type="u8" shape="13" offset="344" size="13" />
			<output>
				<port id="0" precision="U8">
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_161446" type="Const" version="opset1">
			<data element_type="u8" shape="5" offset="357" size="5" />
			<output>
				<port id="0" precision="U8">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="RegexNormalization_161447" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>13</dim>
				</port>
				<port id="5" precision="U8">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="9" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_161449" type="Const" version="opset1">
			<data element_type="u8" shape="1" offset="362" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_161451" type="Const" version="opset1">
			<data element_type="u8" shape="3" offset="363" size="3" />
			<output>
				<port id="0" precision="U8">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="RegexNormalization_161452" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="9" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_161454" type="Const" version="opset1">
			<data element_type="i32" shape="32011" offset="366" size="128044" />
			<output>
				<port id="0" precision="I32">
					<dim>32011</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_161456" type="Const" version="opset1">
			<data element_type="i32" shape="32011" offset="128410" size="128044" />
			<output>
				<port id="0" precision="I32">
					<dim>32011</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_161458" type="Const" version="opset1">
			<data element_type="u8" shape="211088" offset="256454" size="211088" />
			<output>
				<port id="0" precision="U8">
					<dim>211088</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_161466" type="Const" version="opset1">
			<data element_type="i32" shape="61249" offset="467542" size="244996" />
			<output>
				<port id="0" precision="I32">
					<dim>61249</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_161468" type="Const" version="opset1">
			<data element_type="i32" shape="61249" offset="712538" size="244996" />
			<output>
				<port id="0" precision="I32">
					<dim>61249</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_161470" type="Const" version="opset1">
			<data element_type="u8" shape="254123" offset="957534" size="254123" />
			<output>
				<port id="0" precision="U8">
					<dim>254123</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_161472" type="Const" version="opset1">
			<data element_type="i32" shape="61249" offset="1211657" size="244996" />
			<output>
				<port id="0" precision="I32">
					<dim>61249</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_161474" type="Const" version="opset1">
			<data element_type="i32" shape="61249" offset="1456653" size="244996" />
			<output>
				<port id="0" precision="I32">
					<dim>61249</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_161476" type="Const" version="opset1">
			<data element_type="u8" shape="167806" offset="1701649" size="167806" />
			<output>
				<port id="0" precision="U8">
					<dim>167806</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_161460" type="Const" version="opset1">
			<data element_type="i32" shape="475" offset="1869455" size="1900" />
			<output>
				<port id="0" precision="I32">
					<dim>475</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_161462" type="Const" version="opset1">
			<data element_type="i32" shape="475" offset="1871355" size="1900" />
			<output>
				<port id="0" precision="I32">
					<dim>475</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_161464" type="Const" version="opset1">
			<data element_type="u8" shape="6808" offset="1873255" size="6808" />
			<output>
				<port id="0" precision="U8">
					<dim>6808</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_161477" type="Const" version="opset1">
			<data element_type="i32" shape="475" offset="1880063" size="1900" />
			<output>
				<port id="0" precision="I32">
					<dim>475</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="BPETokenizer_161478" type="BPETokenizer" version="extension">
			<data unk_token="&lt;unk>" fuse_unk="true" suffix_indicator="" end_suffix="" byte_fallback="true" cache_capacity="20000" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>32011</dim>
				</port>
				<port id="6" precision="I32">
					<dim>32011</dim>
				</port>
				<port id="7" precision="U8">
					<dim>211088</dim>
				</port>
				<port id="8" precision="I32">
					<dim>61249</dim>
				</port>
				<port id="9" precision="I32">
					<dim>61249</dim>
				</port>
				<port id="10" precision="U8">
					<dim>254123</dim>
				</port>
				<port id="11" precision="I32">
					<dim>61249</dim>
				</port>
				<port id="12" precision="I32">
					<dim>61249</dim>
				</port>
				<port id="13" precision="U8">
					<dim>167806</dim>
				</port>
				<port id="14" precision="I32">
					<dim>475</dim>
				</port>
				<port id="15" precision="I32">
					<dim>475</dim>
				</port>
				<port id="16" precision="U8">
					<dim>6808</dim>
				</port>
				<port id="17" precision="I32">
					<dim>475</dim>
				</port>
			</input>
			<output>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="19" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="20" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_161479" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1881963" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="37" name="Constant_161481" type="Const" version="opset1">
			<data element_type="u8" shape="4" offset="1881967" size="4" />
			<output>
				<port id="0" precision="U8">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_161483" type="Const" version="opset1">
			<data element_type="u8" shape="13" offset="1881971" size="13" />
			<output>
				<port id="0" precision="U8">
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Truncate_161484" type="Truncate" version="extension">
			<data m_num_inputs="1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="U8">
					<dim>4</dim>
				</port>
				<port id="5" precision="U8">
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_161485" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1881984" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="CombineSegments_161486" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Subtract_161487" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_161488" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1881984" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="44" name="ReduceMax_161489" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="45" name="Constant_161490" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1881988" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="46" name="RaggedToDense_161491" type="RaggedToDense" version="extension">
			<data pad_right="false" m_pad_max_length="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Convert_161492" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Convert_161492.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="RaggedToDense_161491.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Result_161495" type="Result" version="opset1" output_names="input_ids">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="49" name="Result_161497" type="Result" version="opset1" output_names="attention_mask">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="15" to-port="2" />
		<edge from-layer="2" from-port="2" to-layer="15" to-port="3" />
		<edge from-layer="2" from-port="3" to-layer="15" to-port="4" />
		<edge from-layer="3" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="6" from-port="3" to-layer="8" to-port="1" />
		<edge from-layer="6" from-port="3" to-layer="11" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="2" />
		<edge from-layer="8" from-port="3" to-layer="15" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="1" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="2" />
		<edge from-layer="13" from-port="3" to-layer="15" to-port="1" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="5" />
		<edge from-layer="15" from-port="8" to-layer="18" to-port="0" />
		<edge from-layer="15" from-port="9" to-layer="18" to-port="1" />
		<edge from-layer="15" from-port="10" to-layer="18" to-port="2" />
		<edge from-layer="15" from-port="11" to-layer="18" to-port="3" />
		<edge from-layer="15" from-port="6" to-layer="35" to-port="0" />
		<edge from-layer="15" from-port="7" to-layer="35" to-port="1" />
		<edge from-layer="16" from-port="0" to-layer="18" to-port="4" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="5" />
		<edge from-layer="18" from-port="6" to-layer="21" to-port="0" />
		<edge from-layer="18" from-port="7" to-layer="21" to-port="1" />
		<edge from-layer="18" from-port="8" to-layer="21" to-port="2" />
		<edge from-layer="18" from-port="9" to-layer="21" to-port="3" />
		<edge from-layer="19" from-port="0" to-layer="21" to-port="4" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="5" />
		<edge from-layer="21" from-port="6" to-layer="35" to-port="2" />
		<edge from-layer="21" from-port="7" to-layer="35" to-port="3" />
		<edge from-layer="21" from-port="8" to-layer="35" to-port="4" />
		<edge from-layer="22" from-port="0" to-layer="35" to-port="5" />
		<edge from-layer="23" from-port="0" to-layer="35" to-port="6" />
		<edge from-layer="24" from-port="0" to-layer="35" to-port="7" />
		<edge from-layer="25" from-port="0" to-layer="35" to-port="8" />
		<edge from-layer="26" from-port="0" to-layer="35" to-port="9" />
		<edge from-layer="27" from-port="0" to-layer="35" to-port="10" />
		<edge from-layer="28" from-port="0" to-layer="35" to-port="11" />
		<edge from-layer="29" from-port="0" to-layer="35" to-port="12" />
		<edge from-layer="30" from-port="0" to-layer="35" to-port="13" />
		<edge from-layer="31" from-port="0" to-layer="35" to-port="14" />
		<edge from-layer="32" from-port="0" to-layer="35" to-port="15" />
		<edge from-layer="33" from-port="0" to-layer="35" to-port="16" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="17" />
		<edge from-layer="35" from-port="18" to-layer="39" to-port="0" />
		<edge from-layer="35" from-port="19" to-layer="39" to-port="1" />
		<edge from-layer="35" from-port="20" to-layer="39" to-port="2" />
		<edge from-layer="36" from-port="0" to-layer="39" to-port="3" />
		<edge from-layer="37" from-port="0" to-layer="39" to-port="4" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="5" />
		<edge from-layer="39" from-port="6" to-layer="41" to-port="0" />
		<edge from-layer="39" from-port="7" to-layer="41" to-port="1" />
		<edge from-layer="39" from-port="8" to-layer="41" to-port="2" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="3" />
		<edge from-layer="41" from-port="5" to-layer="42" to-port="0" />
		<edge from-layer="41" from-port="4" to-layer="42" to-port="1" />
		<edge from-layer="41" from-port="4" to-layer="46" to-port="0" />
		<edge from-layer="41" from-port="5" to-layer="46" to-port="1" />
		<edge from-layer="41" from-port="6" to-layer="46" to-port="2" />
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="44" from-port="2" to-layer="46" to-port="3" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="4" />
		<edge from-layer="46" from-port="6" to-layer="47" to-port="0" />
		<edge from-layer="46" from-port="5" to-layer="50" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="48" from-port="1" to-layer="49" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="51" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="1" />
		<chat_template value="{% for message in messages %}{% if message['role'] == 'system' %}{{'&lt;|system|>&#10;' + message['content'] + '&lt;|end|>&#10;'}}{% elif message['role'] == 'user' %}{{'&lt;|user|>&#10;' + message['content'] + '&lt;|end|>&#10;'}}{% elif message['role'] == 'assistant' %}{{'&lt;|assistant|>&#10;' + message['content'] + '&lt;|end|>&#10;'}}{% endif %}{% endfor %}{% if add_generation_prompt %}{{ '&lt;|assistant|>&#10;' }}{% else %}{{ eos_token }}{% endif %}" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="32000" />
		<handle_special_tokens_with_re />
		<max_length />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.2.0.1-567-7885335c24b" />
		<openvino_version value="2025.2.0-19140-c01cd93e24d-releases/2025/2" />
		<original_post_processor_template value="{&quot;type&quot;: &quot;TemplateProcessing&quot;, &quot;single&quot;: [{&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}], &quot;pair&quot;: [{&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;B&quot;, &quot;type_id&quot;: 1}}], &quot;special_tokens&quot;: {}}" />
		<original_tokenizer_class value="&lt;class 'transformers.models.llama.tokenization_llama_fast.LlamaTokenizerFast'>" />
		<pad_token_id value="32000" />
		<processed_post_processor_template value="{&quot;single&quot;: {&quot;ids&quot;: [-1], &quot;type_ids&quot;: [0]}, &quot;pair&quot;: {&quot;ids&quot;: [-1, -2], &quot;type_ids&quot;: [0, 1]}}" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.21.4" />
		<transformers_version value="4.53.3" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
